import Block from "./info/Block"
import Card from "./info/Card"

export default function Info() {
	return (
		<div className="flex-center flex-col space-y-8 p-6">
			<div className="text-center space-y-4">
				<h2 className="font-semibold text-3xl">О нашем клубе</h2>
				<p className="container max-w-3xl"> Мы - клуб РТУ МИРЭА, который смог собрать людей, интересующихся культурой Японии.<br/> Наши участники любят посещать самые разные мероприятия, некоторым нравится писать занимательные статьи о жизни в Японии, о быте японцев и о многом другом.<br/> Другим приятно просто общаться в компании людей со схожими увлечениями.<br/> А кому-то нравится своя определенная тематика. Но всех нас объединяет любовь к Японии - стране, где есть самураи, странная еда и постройки, древние храмы, красивая природа, многовековые традиции, аниме и многое другое.</p>
			</div>

			<div className="grid gap-4 md:grid-cols-3 xl:px-16 space-y-4 md:space-y-0 pb-2">
				<Block
					title="Мероприятия"
					description="Наш клуб участвует в мероприятиях, а также проводит их, мы расскажем и покажем все самое интересное о Японии."
					icon_src="event"
				/>
				<Block
					title="Атмосфера"
					description="Приятная ламповая атмосфера в клубе влюбит в себя абсолютно любого и никого не оставит равнодушным."
					icon_src="favorite"
				/>
				<Block
					title="Обучение"
					description="Остается только предполагать, сколько всего узнали наши участники за время существования клуба."
					icon_src="school"
				/>
			</div>

			<div className="grid gap-4 lg:grid-cols-3 xl:px-16">
				<Card
					title="Аниме"
					description="Уже неотъемлемая часть японской культуры. У нас вы найдете с кем обсудить и новые тайтлы и классику аниме. Ко всему прочему мы также проводим показы занимательных картин."
					img="anime"
				/>
				<Card
					title="Мифология"
					description="Если вам небезразлична пугающе интересная мифология Японии, то вы пришли по адресу."
					img="mythology"
				/>
				<Card
					title="Природа"
					description="Нельзя не сказать об удивительной природе Японии. Сколько в ней красоты и умиротворения."
					img="nature"
				/>
			</div>
		</div>
	)
}